---
kind: type
id: T:Autodesk.Revit.DB.Macros.ApplicationEntryPoint
source: html/f18a0fa9-29ba-111e-e1e9-2124ec3c4d2b.htm
---
# Autodesk.Revit.DB.Macros.ApplicationEntryPoint

For Revit Macros use only.

## Syntax (C#)
```csharp
public abstract class ApplicationEntryPoint : Application,
	IEntryPoint
```